Repository: doc-autoit-fr/omegat
Catalog: tm/auto/AutoItFr_201503.tmx
Source language: en
Languages: fr

source: Assign a Local variable the socket and bind to the IP Address and Port specified.
fr: Assigne une variable locale avec le socket et se connecte à l'adresse IP et au port spécifiés.

source: Someone is probably already binded on this IP Address and Port (script already running?).
fr: Quelqu'un est probablement déjà connecté sur cette adresse IP et ce port (script déjà en cours d'exécution?).

source: The socket/array as returned by a UDPBind or UDPOpen functions.
fr: Le socket ou le tableau retourné par la fonction UDPBind ou UDPOpen.

source: 0 and sets the @error flag to no-zero.
fr: Retourne 0 et @error <> 0.

source: -1, -2 or -3 invalid socketarray.
fr: -1, -2 ou -3 socket ou tableau invalide.

source: Assign a Local variable to store the data received.
fr: Assigne une variable locale pour stocker les données reçues.

source: We are waiting for the string "toto" OR "tata" (example script UDPSend):
fr: Nous attendons la chaîne "toto" OU "tata" (exemple de script UDPSend) :

source: Send the string "toto" converted to binary to the server.
fr: Envoier la chaîne 'toto' convertie en binaire sur le serveur.

source: 0 - (Default) - No additional options are set.
fr: 0 = (Défaut) - Aucune option supplémentaire n'est définie.

source: 1 - Allow the broadcasting on the address "255.255.255.255".
fr: 1 = Autorise le broadcast sur l'adresse "255.255.255.255".

source: We need this information in subsequent calls to UDPSend(), where we pass this socket structure/array.
fr: Nous avons besoin de ces informations pour des appels ultérieurs à UDPSend(), où nous passons cette structure/tableau de socket.

source: $aArray[0]=0 and set the @error flag to non-zero.
fr: Retourne $array[0]=0 et @error <> 0.

source: (Start first the UDPSend/Recv example script and select "1.
fr: (Commencez d'abord par l'exemple de script UDPSend/Recv et sélectionnez "1.

source: Server").
fr: Serveur").

source: The socket/array as returned by a UDPBind function.
fr: La socket ou le tableau retourné par la fonction UDPBind.

source: Forces the function to return receive from IP/port if set to 2.
fr: Force la fonction à retourner ce qui est reçu de l'IP ou du port si le paramètre est à 2.

source: Results are returned in an Array :
fr: Les résultats sont retournés dans un tableau :

source: [0] data, [1] from IP, [2] from Port.
fr: [0] données, [1] de l'IP, [2] du port.

source: If you want both just use 3.
fr: Si vous souhaitez les deux, mettez le paramètre à 3.

source: a binary/string sent by the opened socket or an array if flag = 2 or 3.
fr: Retourne le binaire ou la chaîne envoyée par le socket ouvert ou un tableau si le paramètre flag est à 2 ou 3.

source: The main socket/array as returned by a UDPOpen function.
fr: La socket ou le tableau retourné par la fonction UDPOpen.

source: binary/string to be sent to the connected socket
fr: Binaire ou chaine qui doit être envoyé au socket connecté.

source: the number of bytes sent to the opened socket.
fr: Retourne le nombre d'octets envoyés au socket ouvert.

source: Variables and Conversions functions Reference
fr: Variables and Conversions - Référence Fonctions

source: Returns the internal type representation of a variant.
fr: Retourne le type de représentation interne d'un variant.

source: An expression to check the internal type of.
fr: Une expression dont on veut analyser le type interne.

source: Returns a string representing the type of the expression.
fr: Retourne une chaîne représentant le type d'expression.

source: IsInt() can return different results as it tries to convert from a float, for example calling VarGetType() with a value of 2.0 will return "Double", but IsInt() will return 1 for the same value.
fr: IsInt() peut retourner des résultats différents puisqu'il essaie de convertir depuis un float, par exemple appeler VarGetType() avec une valeur de 2.0 retournera "Double", mais IsInt() retournera 1 pour la même valeur.

source: Visa user defined functions Reference
fr: Visa - Référence

source: When using them you need to add a #include <Visa.au3>.
fr: Pour les utiliser, vous aurez besoin d'ajouter #include <Visa.au3>.

source: Activates (gives focus to) a window.
fr: Active (donne le focus) à une fenêtre.

source: The text of the window to activate.
fr: Le texte de la fenêtre à activer.

source: the handle of the window.
fr: Retourne le handle de la fenêtre.

source: 0 if window is not found or cannot be activated.
fr: Retourne 0 si la fenêtre n'est pas trouvée ou ne peut pas être activée.

source: You can use the WinActive() function to check if WinActivate() succeeded.
fr: Vous pouvez utiliser la fonction WinActive() pour vérifier si WinActivate() a réussi.

source: If multiple windows match the criteria, the window that was most recently active is the one activated.
fr: Si plusieurs fenêtres correspondent aux critères, la fenêtre la plus récente sera activée.

source: WinActivate() works on minimized windows.
fr: WinActivate() fonctionne sur les fenêtres réduites.

source: However, a window that is "Always On Top" could still cover up a window you Activated.
fr: Toutefois, une fenêtre qui est "Always On Top" peut encore couvrir une fenêtre que vous avez activée.

source: Afer a successful activation @extended is set to 1 if the the window was already active, 2 if not.
fr: Après une activation réussie, @extended contient 1 si la fenêtre était déjà active, 2 sinon.

source: Activate the Notepad window using the handle returned by WinWait.
fr: Active la fenêtre du Bloc-notes en utilisant le handle renvoyé par WinWait.

source: Checks to see if a specified window exists and is currently active.
fr: Vérifie si une fenêtre spécifiée existe et si elle est active.

source: the handle to the window if it is active.
fr: Retourne le handle de la fenêtre si elle est active.

source: 0 otherwise.
fr: Retourne 0.

source: Check if Notepad is currently active.
fr: Vérifie si le bloc-notes est actuellement actif.

source: WinAPI user defined functions Reference
fr: WinAPI - Référence

source: When using them you need to add a #include <WinAPI.au3>.
fr: Pour les utiliser, vous aurez besoin d'ajouter #include <WinAPI.au3>.

source: Administration user defined functions Reference
fr: Administration - Référence

source: Audio user defined functions Reference
fr: Audio - Référence

source: When using them you need to add a #include <WinAPIMisc.au3>.
fr: Pour les utiliser, vous aurez besoin d'ajouter #include <WinAPIMisc.au3>.

source: Automation user defined functions Reference
fr: Automation - Référence

source: BitMap user defined functions Reference
fr: BitMap - Référence

source: Brush & Pen user defined functions Reference
fr: Brush & Pen - Référence

source: Carets user defined functions Reference
fr: Carets - Référence

source: When using them you need to add a #include <WinAPIRes.au3>.
fr: Pour les utiliser, vous aurez besoin d'ajouter #include <WinAPIRes.au3>.

source: Clipping user defined functions Reference
fr: Clipping - Référence

source: COM user defined functions Reference
fr: COM - Référence

source: When using them you need to add a #include <WinAPICom.au3>.
fr: Pour les utiliser, vous aurez besoin d'ajouter #include <WinAPICom.au3>.

source: Controls user defined functions Reference
fr: Controls - Référence

source: Conversion user defined functions Reference
fr: Conversion - Référence

source: Coordinate & Transform user defined functions Reference
fr: Coordinate & Transform - Référence

source: Cursors user defined functions Reference
fr: Cursors - Référence

source: DataAccess & Storage user defined functions Reference
fr: DataAccess & Storage - Référence

source: When using them you need to add a #include <WinAPIFiles.au3>.
fr: Pour les utiliser, vous aurez besoin d'ajouter #include <WinAPIFiles.au3>.

source: Desktop Window Manager user defined functions Reference
fr: Desktop Window Manager - Référence

source: DeviceContext user defined functions Reference
fr: DeviceContext - Référence

source: DevicesIoCtl user defined functions Reference
fr: DevicesIoCtl - Référence

source: Diagnostic user defined functions Reference
fr: Diagnostic - Référence

source: When using them you need to add a #include <WinAPIDiag.au3>.
fr: Pour les utiliser, vous aurez besoin d'ajouter #include <WinAPIDiag.au3>.

source: Dialog user defined functions Reference
fr: Dialog - Référence

source: When using them you need to add a #include <WinAPIDlg.au3>.
fr: Pour les utiliser, vous aurez besoin d'ajouter #include <WinAPIDlg.au3>.

source: DLLLib user defined functions Reference
fr: DLLLib - Référence

source: Files user defined functions Reference
fr: Files - Référence

source: Font & Text user defined functions Reference
fr: Font & Text - Référence

source: Heap user defined functions Reference
fr: Heap - Référence

source: Icons user defined functions Reference
fr: Icons - Référence

source: Internationalization user defined functions Reference
fr: Internationalization - Référence

source: When using them you need to add a #include <WinAPILocale.au3>.
fr: Pour les utiliser, vous aurez besoin d'ajouter #include <WinAPILocale.au3>.

source: Line & Curve user defined functions Reference
fr: Line & Curve - Référence

source: MetaFiles user defined functions Reference
fr: MetaFiles - Référence

source: Monitors user defined functions Reference
fr: Monitors - Référence

source: Paint & Draw user defined functions Reference
fr: Paint & Draw - Référence

source: Path user defined functions Reference
fr: Path - Référence

source: Power user defined functions Reference
fr: Power - Référence

source: Rectangle user defined functions Reference
fr: Rectangle - Référence

source: Registry user defined functions Reference
fr: Registry - Référence

source: When using them you need to add a #include <WinAPIReg.au3>.
fr: Pour les utiliser, vous aurez besoin d'ajouter #include <WinAPIReg.au3>.

source: Resources user defined functions Reference
fr: Resources - Référence

source: Shape user defined functions Reference
fr: Shape - Référence

source: ShellEx user defined functions Reference
fr: ShellEx - Référence

source: When using them you need to add a #include <WinAPIShellEx.au3>.
fr: Pour les utiliser, vous aurez besoin d'ajouter #include <WinAPIShellEx.au3>.

source: ShellPath user defined functions Reference
fr: ShellPath - Référence

source: When using them you need to add a #include <WinAPIShPath.au3>.
fr: Pour les utiliser, vous aurez besoin d'ajouter #include <WinAPIShPath.au3>.

source: Station & Desktop user defined functions Reference
fr: Station & Desktop - Référence

source: Struct user defined functions Reference
fr: Struct - Référence

source: Synchronization user defined functions Reference
fr: Synchronization - Référence

source: SysInfo user defined functions Reference
fr: SysInfo - Référence

source: Theme user defined functions Reference
fr: Theme - Référence

source: When using them you need to add a #include <WinAPITheme.au3>.
fr: Pour les utiliser, vous aurez besoin d'ajouter #include <WinAPITheme.au3>.

source: UserInteraction user defined functions Reference
fr: UserInteraction - Référence

source: Windows user defined functions Reference
fr: Windows - Référence

source: Closes a window.
fr: Ferme une fenêtre.

source: The title/hWnd/class of the window to close.
fr: Le titre/hWnd/class de la fenêtre à fermer.

source: The text of the window to close.
fr: Le texte de la fenêtre à fermer.

source: 0 if the window is not found.
fr: Retourne 0 si la fenêtre n'est pas trouvée.

source: This function sends a close message to a window, the result depends on the window (it may ask to save data, etc.).
fr: Cette fonction envoie un message de fermeture à une fenêtre, le résultat dépend de la fenêtre (elle peut demander d'enregistrer des données, etc...).

source: To force a window to close, use the WinKill() function.
fr: Pour forcer une fenêtre à se fermer, utilisez la fonction WinKill().

source: If multiple windows match the criteria, the window that was most recently active is closed.
fr: Si plusieurs fenêtres correspondent aux critères, la fenêtre active la plus récente est fermée.

source: Wait for 2 seconds to display the Notepad window.
fr: Attend 2 secondes pour afficher la fenêtre du Bloc-notes.

source: Close the Notepad window using the classname of Notepad.
fr: Ferme la fenêtre du Bloc-notes à l'aide du nom de classe du Bloc-notes.

source: Window functions Reference
fr: Window - Référence Fonctions

source: Checks to see if a specified window exists.
fr: Vérifie si la fenêtre indiquée existe.

source: Flashes a window in the taskbar.
fr: Fait clignoter une fenêtre dans la barre des tâches.

source: Returns the coordinates of the caret in the foreground window.
fr: Retourne les coordonnées du curseur dans la fenêtre du premier plan.

source: Retrieves the classes from a window.
fr: Récupère les classes d'une fenêtre.

source: Retrieves the size of a given window's client area.
fr: Récupère la taille de la zone client d'une fenêtre.

source: Retrieves the internal handle of a window.
fr: Récupère le handle interne d'une fenêtre.

source: Retrieves the position and size of a given window.
fr: Récupère la position et la taille de la fenêtre indiquée.

source: Retrieves the Process ID (PID) associated with a window.
fr: Récupère l'identifiant du processus (PID) associé à une fenêtre.

source: Retrieves the state of a given window.
fr: Récupère l'état d'une fenêtre donnée.

source: Retrieves the text from a window.
fr: Récupère le texte d'une fenêtre.

source: Retrieves the full title from a window.
fr: Récupère le titre complet d'une fenêtre.

source: Forces a window to close.
fr: Force la fermeture d'une fenêtre.

source: Retrieves a list of windows.
fr: Récupère une liste de fenêtres.

source: Invokes a menu item of a window.
fr: Sélectionne un élément du menu d'une fenêtre.

source: Minimizes all windows.
fr: Minimise toutes les fenêtres.

source: Undoes a previous WinMinimizeAll function.
fr: Annule un précédent WinMinimizeAll.

source: Moves and/or resizes a window.
fr: Déplace et/ou redimensionne une fenêtre.

source: Change a window's "Always On Top" attribute.
fr: Change l'attribut "Always On Top" d'une fenêtre.

source: Shows, hides, minimizes, maximizes, or restores a window.
fr: Montre, cache, minimise, maximise ou restaure une fenêtre.

source: Changes the title of a window.
fr: Change le titre d'une fenêtre.

source: Sets the transparency of a window.
fr: Définit la transparence d'une fenêtre.

source: Pauses execution of the script until the requested window exists.
fr: Met le script en pause jusqu'à ce que la fenêtre indiquée existe.

source: Pauses execution of the script until the requested window is active.
fr: Met le script en pause jusqu'à ce que la fenêtre indiquée soit active.

source: Pauses execution of the script until the requested window does not exist.
fr: Met le script en pause jusqu'à ce que la fenêtre indiquée n'existe plus.

source: Pauses execution of the script until the requested window is not active.
fr: Met le script en pause jusqu'à ce que la fenêtre indiquée ne soit plus active.

source: WinExists() will return 1 even if the window is hidden.
fr: WinExists() retournera 1 même si la fenêtre est cachée.

source: Test if the window exists and display the results.
fr: Teste si la fenêtre existe et affiche les résultats.

source: The title/hWnd/class of the window to change.
fr: Le titre/hWnd/class de la fenêtre à traiter.

source: The text of the window to change.
fr: Le texte de la fenêtre à traiter.

source: The amount of times to flash the window.
fr: Le nombre de clignotements de la fenêtre.

source: Default 4.
fr: Par défaut 4.

source: The time in milliseconds to sleep between each flash.
fr: Le temps d'attente en milliseconde entre deux clignotements.

source: Default 500 ms.
fr: Par défaut 500 ms.

source: This function is very useful for catching the user's eye!
fr: Cette fonction est très utile pour attirer l'attention de l'utilisateur.

source: Flash the window 4 times with a break in between each one of 1/2 second.
fr: Fait clignoter la fenêtre quatre fois avec une pause entre chaque de 2.1 secondes.

source: a 2-element array containing the following information:
fr: Retourne un tableau à 2 éléments contenant les informations suivantes:

source: $aArray[0] = X coordinate
fr: $array[0] = Coordonnée X

source: $aArray[1] = Y coordinate
fr: $array[1] = Coordonnée Y

source: WinGetCaretPos() might not return accurate values for Multiple Document Interface (MDI) applications if absolute CaretCoordMode is used.
fr: WinGetCaretPos() peut ne pas retourner des valeurs précises pour des applications 'Multiple Document Interface' (MDI) si CaretCoordMode est utilisée avec l'option absolute.

source: See example for a workaround.
fr: Voir l'exemple pour une solution de contournement.

source: Some applications report static coordinates regardless of caret position!
fr: Certaines applications signalent des coordonnées statiques quelle que soit la position du curseur !

source: A more reliable method to retrieve the caret coordinates in MDI text editors.
fr: Une méthode plus fiable pour récupérer les coordonnées du curseur dans des éditeurs de texte MDI.

source: Set "CaretCoordMode" to relative mode and store the previous option.
fr: Définit "CaretCoordMode" en mode relatif et stocke l'option précédente.

source: Retrieve the relative caret coordinates.
fr: Récupére les coordonnées relatives du curseur.

source: Retrieve the position as well as height and width of the active window.
fr: Récupére la position ainsi que la hauteur et la largeur de la fenêtre active.

source: Retrieve the control name that has keyboard focus.
fr: Récupére le nom du contrôle qui a le focus clavier.

source: Retrieve the position as well as the size of the control.
fr: Récupére la position ainsi que la taille du contrôle.

source: Reset "CaretCoordMode" to the previous option.
fr: Re-initialise "CaretCoordMode" à l'option précédente.

source: Create an array to store the x, y position.
fr: Crée un tableau pour stocker la position x, y.

source: Return the array.
fr: Retour du tableau.

source: Return the array and set @error to 1.
fr: Retourne le tableau et définit @error à 1.

source: The title/hWnd/class of the window to get the classes.
fr: Le titre/hWnd/class de la fenêtre à traiter.

source: The text of the window to get the classes.
fr: Le texte de la fenêtre à traiter.

source: a string containing the window classes read.
fr: Retourne une chaîne contenant les classes de fenêtre lues.

source: "" and sets the @error flag to non-zero if the criteria does not match a window.
fr: Retourne "" et @error <> 0 si aucune fenêtre ne correspond aux critères.

source: Class names are linefeed (@LF) separated.
fr: Les noms de classe sont séparés par des sauts de ligne (@LF).

source: WinGetClassList() works on both minimized and hidden windows.
fr: WinGetClassList() fonctionne aussi sur les fenêtres minimisées et cachées.

source: Up to 64KB of text can be retrieved.
fr: Jusqu'à 64 Ko de texte peut être récupéré.

source: If multiple windows match the criteria, the classes are read from the most recently active window.
fr: Si plusieurs fenêtres correspondent aux critères, les classes sont lues à partir de la fenêtre active la plus récente.

source: Retrieve the classlist of the Notepad window using the handle returned by WinWait.
fr: Récupére la liste des classes de la fenêtre du Bloc-notes en utilisant le handle renvoyé par WinWait.

source: Display the classlist.
fr: Affiche la liste de classe.

source: The title/hWnd/class of the window to get the size.
fr: Le titre/hWnd/class de la fenêtre à traiter.

source: The text of the window to get the size.
fr: Le texte de la fenêtre à traiter.

source: $aArray[0] = Width of window's client area
fr: $array[0] = Largeur de la zone client de la fenêtre

source: $aArray[1] = Height of window's client area
fr: $array[1] = Hauteur de la zone client de la fenêtre

source: sets the @error flag to non-zero if the window is not found.
fr: Retourne @error <> 0 si la fenêtre n'est pas trouvée.

source: If the window is minimized, the returned width and height values are both zero.
fr: Si la fenêtre est réduite, la largeur et la hauteur retournées sont toutes deux nulles.

source: However, WinGetClientSize() works correctly on (non-minimized) hidden windows.
fr: Toutefois, WinGetClientSize() fonctionne correctement sur les fenêtres cachées (non réduites).

source: If the window title "Program Manager" is used, the function will return the size of the desktop.
fr: Si le titre de la fenêtre "Program Manager» est utilisé, la fonction retourne la taille du bureau.

source: If multiple windows match the criteria, the most recently active window is used.
fr: Si plusieurs fenêtres correspondent aux critères, la fenêtre active la plus récente est utilisée.

source: Retrieve the client area of the Notepad window using the handle returned by WinWait.
fr: Récupére la zone client de la fenêtre du Bloc-notes en utilisant le handle renvoyé par WinWait.

source: Display the height and width of the client area.
fr: Affiche la hauteur et la largeur de la zone client.

source: The title/hWnd/class of the window to get the handle.
fr: Le titre/hWnd/class de la fenêtre à traiter.

source: The text of the window to get the handle.
fr: Le texte de la fenêtre à traiter.

source: a handle to the window.
fr: Retourne le handle de la fenêtre.

source: This function allows you to use handles to specify windows rather than "title" and "text".
fr: Cette fonction vous permet d'utiliser les handles pour spécifier les fenêtres plutôt que le "titre" et le "texte".

source: Once you have obtained the handle you can access the required window even if its title changes.
fr: Une fois que vous avez obtenu le handle, vous pouvez accéder à la fenêtre, même si son titre change.

source: Retrieve the handle of the Notepad window using the classname of Notepad.
fr: Récupére le handle de la fenêtre du Bloc-notes à l'aide du nom de classe du Bloc-notes.

source: Display the handle of the Notepad window.
fr: Affiche Le handle de la fenêtre du Bloc-notes.

source: Close the Notepad window using the handle returned by WinGetHandle.
fr: Ferme la fenêtre du Bloc-notes en utilisant le handle renvoyé par WinGetHandle.

source: The title/hWnd/class of the window to get the position/size.
fr: Le titre/hWnd/class de la fenêtre à traiter.

source: The text of the window to get the position/size.
fr: Le texte de la fenêtre à traiter.

source: a 4-element array containing the following information:
fr: Retourne un tableau de 4 éléments contenant les informations suivantes :

source: WinGetPos() returns negative numbers such as -32000 for minimized windows, but works fine with (non-minimized) hidden windows.
fr: WinGetPos() retourne des nombres négatifs tels que -32000 pour les fenêtres minimisées, mais fonctionne très bien avec des fenêtres masquées (non réduites).

source: Display the array values returned by WinGetPos.
fr: Affiche les valeurs de tableau retourné par WinGetPos.

source: The title/hWnd/class of the window to get the PID.
fr: Le titre/hWnd/class de la fenêtre à traiter.

source: The text of the window to get the PID.
fr: Le texte de la fenêtre à traiter.

source: a process ID (PID).
fr: Retourne l'identifiant du processus (PID).

source: -1 if the window is not found.
fr: Retourne -1 si la fenêtre n'est pas trouvée.

source: Retrieve the PID of Notepad using the window handle returned by WinWait.
fr: Récupére le PID du Bloc-notes en utilisant Le handle de fenêtre retourné par WinWait.

source: Display the PID of the window.
fr: Affiche le PID de la fenêtre.

source: The title/hWnd/class of the window to get the state.
fr: Le titre/hWnd/class de la fenêtre à traiter.
